{
  "searchTerms": [
    "TYPO3",
    "t3popcorn",
    "typoscript",
    "t3lib_div",
    "t3board",
    "extbase",
    "fluid typo3",
    "fluid extbase",
    "t3uxw",
    "t3see",
    "t3cs",
    "typoleaks",
    "t3ee",
    "t3illuminati",
    "CertiFUNcation",
    "T3THX",
    "t3dd",
    "t3cb",
    "t3cmallorca",
    "t3runners",
    "t3bits",
    "t3inc"
  ],
  "userBlackList": [
    "T3Popcorn",
    "helhum",
    "typo3",
    "typo3_git",
    "typo3neos",
    "typo3flow",
    "maddy2101",
    "t3git_master",
    "MarcusSchwemer",
    "randomresult",
    "TYPO3server",
    "eworkDE",
    "thomasruta",
    "bgwebdesign",
    "cmscrawler"
  ],
  "replies": [
    "Have fun with TYPO3",
    "Sharing is caring",
    "Inspiring people to share",
    "Contributed to TYPO3 today?",
    "Remember to share TYPO3 gossip with the hashtag #t3popcorn",
    "Tweet a photo of your #LTSFACE",
    "Be considerate, be respectful, be collaborative",
    "When you disagree, consult others, When you are unsure, ask for help",
    "Do you want to join the community or one of our teams? It is easy to get involved!",
    "It's really the TYPO3 spirit, and not so much the code, that makes the TYPO3 community tick.",
    "If you want to contribute to the community as a developer, you can supply patches",
    "If you want to contribute to the community as a developer, you can do testing",
    "If you want to contribute to the community as a developer, you can help others",
    "If you want to contribute to the community as a developer, you can join the project",
    "Keep calm and flush caches",
    "Looks ugly",
    "To make this work, we would need to adjust GeneralUtility",
    "Did you try to remove the contents of the typo3temp directory?",
    "You need to clear the reflection cache manually to solve this kind of problem",
    "Create a file typo3conf/ENABLE_INSTALL_TOOL",
    "Ensure that JavaScript and Cookies are enabled in your browser.",
    "The FLUIDTEMPLATE object was introduced in TYPO3 4.5.",
    "Finally TYPO3 has solid error handling since version 4.0.1.",
    "One way for extensions to take over control of certain parts of TYPO3's core is using hooks.",
    "Single quotes (') must be escaped with a single backslash, if surrounded by a higher level single quote of the outer ViewHelper",
    "After updating from TYPO3 < 4.0 to 4.0 or later versions, the plugin might stop working.",
    "Most advanced FTP programs have an 'edit' button. Please refer to your FTP program's documentation.",
    "$this->_dataStore = new tx_lib_spl_ArrayObject();",
    "You can tell me that TYPO3 4.4.9 and tt_news 2.5.0 is too old.",
    "“OOPS, AN ERROR OCCURRED!” IS NOT A VALID ERROR MESSAGE",
    "in the old times, you could XCLASS your way to world domination.",
    "Who the heck ist General Caches?",
    "Wow. Many caches. So general. Much flushes",
    "Can i haz t3lib_div?",
    "Source or it didn't happen!",
    "SEO is built-in! Check the page properties for the 'keywords' field.",
    "The Development Context should help.",
    "TYPO3 4.5 has Long Term Support. This means you can use it like... forever!",
    "Using raw statements in a repository is the source of all evil.",
    "2015 is the year of Neos. Here we are",
    "1. Prepare your work, 2. Edit content, Oops: an error occured",
    "Interesting project but If you want to code in java, just code in java",
    "TYPO3 requires a web server with a PHP installation and a database.",
    "I will not post here because I replied to this article in the TYPO3 mailing list.",
    "Recent research made clear that TYPO3 is most feared Open Source CMS bij competitors in the Netherlands.",
    "To truly see the pulse of TYPO3 of which there’s easily a 100 tweets and several blogs written a day",
    "Please avoid flamewars, trolling, personal attacks, and repetitive arguments.",
    "maybe you should delete the l10n folder in typo3temp",
    "Bonjour à tous.",
    "Cannot find tslib/. Please set path by defining $configured_tslib_path in JavaProxy.php.",
    "popcorn time #typo3",
    "I don't support this hectic way to do it, after nobody cared for it for years",
    "PNG is not a good Vektor format",
    "go read the source code of fluidpages, the information you seek is in there",
    "Please share inner circle leaks with the hashtag #typoleaks",
    "We have seen over time that TYPO3 CMS is loosing market share and that the CMS industry is getting tougher.",
    "We want to establish a Marketplace for Extensions and introduce the concept of paid extensions.",
    "We really want to change things for the good.",
    "80 Million germans can't be wrong - but we rewrote their favourite CMS from scratch anyway",
    "What you see is what you get",
    "Usability should be a priority and not spartanism.",
    "Sent from Andi's iPhone",
    "Check your PHP error log!",
    "You are long enough to TYPO3 to help yourself.",
    "you are not helpful and just trolling since 5 years",
    "Please create a new topic for a new issue.",
    "+1",
    "Did you file an issue for that in forge?",
    "TYPO3 6.2 LTS will be the last TYPO3 CMS release",
    "TYPO3 Core was completely rewritten in 6.x and now nothing works as it used to",
    "Extensions developed for 4.5 will not work on 6.2",
    "TemplaVoila cannot be used anymore with TYPO3 6.2",
    "tslib_pibase based extensions are no longer supported in 6.2",
    "I need better hardware since 6.2 is 10 times slower than 4.5",
    "In December 2013 TYPO3 v5 (formerly also known as 'Phoenix') was launched as TYPO3 Neos",
    "RHEL offers 11+ yrs support for LTS versions. We can do more!",
    "4.5 Feature: Integer Overflow Through Patch Level Number",
    "You are claiming to know very much, about the procedure and such, but the only fact that I know of, is that you were not involved.",
    "the TYPO3 Association is a body outside the community",
    "7 LTS will introduce In-EXT-purchases",
    "Your passion will lead you to your purpose. Follow it! See ya.",
    "A new extraordinary change in regard of performance was included in 6.2.10. And broke class loading.",
    "can we *please* stop puttin' extension after extension in the sysext folder and start using TER? Thank you!",
    "plugin.tx_news._LOCAL_LANG.de.more-link = Wurstbrot",
    "As usual you are mixing up 3 different things here",
    "As in TYPO3 6.2 TYPE=HTML is no more existing you need to replace this part simply in all existing framework templates with TYPE=TEXT",
    "Well, you thought so but TYPO3 core does not really allow this.",
    "Check FE localisation guide and see that Extbase does it incorrectly.",
    "I believe it does not work because this code is completely incorrect.",
    "Developers should become familiar with the Frontend Localisation Guide before touching this area.",
    "Extbase is a backported subset of Flow - not the other way around, so it has (partly) been funded by the Flow budget in the past.",
    "The BLE project funded large parts of FAL development",
    "that would actually kill two birds with one stone",
    "what is the signal you want to send with this decision?",
    "not money, but the team makes this happen",
    "for the record, it is *one* team for Neos and Flow ;-)",
    "IMHO neos didn't grow out of needs from within neither was it a rewrite but emerged from unpractical, complex and unproved/academical thinking.",
    "TypoScript 2 is on the way to be a very powerful successor to the TypoScript",
    "In early 2012 we got the communication that Extbase will no longer be the bridge from the CMS 6.x branch to Neos",
    "Go with the flow!",
    "For support, please, ask in TYPO3 mailing lists. This place is only for real bugs.",
    "Just refactor TCEmain and then we'll speak again.",
    "With TYPO3 7.x Flow loses one of it’s biggest users - Flow usage drops to 0.001% in germany",
    "You call getMilk and a cow is delivered",
    "Read the FAQ before posting, please.",
    "Language!",
    "please refrain from straw man arguments, it's very annoying.",
    "This is pretty ridiculous. Let's have a nice weekend instead.",
    "No, empty “conflicts“ is not a problem of the extension because it was for years like that and always worked perfectly.",
    "Misconfiguration, no need for the change.",
    "+100"
  ]
}
