{
  "searchTerms": [
    "TYPO3",
    "t3popcorn",
    "typoscript",
    "t3lib_div",
    "t3board",
    "extbase",
    "fluid typo3",
    "fluid extbase",
    "t3uxw",
    "t3see",
    "t3cs"
  ],
  "userBlackList": [
    "T3Popcorn",
    "helhum",
    "typo3",
    "typo3_git",
    "typo3neos",
    "typo3flow",
    "maddy2101",
    "t3git_master",
    "MarcusSchwemer",
    "randomresult",
    "TYPO3server"
  ],
  "replies": [
    "Have fun with TYPO3",
    "Already migrated to TYPO3 7?",
    "Sharing is caring",
    "Inspiring people to share",
    "Contributed to TYPO3 today?",
    "Remember to share TYPO3 gossip with the hashtag #t3popcorn",
    "Embrace, Innovate, Deliver",
    "Tweet a photo of your #LTSFACE",
    "Be considerate, be respectful, be collaborative",
    "When you disagree, consult others, When you are unsure, ask for help",
    "Do you want to join the community or one of our teams? It is easy to get involved!",
    "It's really the TYPO3 spirit, and not so much the code, that makes the TYPO3 community tick.",
    "If you want to contribute to the community as a developer, you can supply patches",
    "If you want to contribute to the community as a developer, you can do testing",
    "If you want to contribute to the community as a developer, you can help others",
    "If you want to contribute to the community as a developer, you can join the project",
    "Keep calm and flush caches",
    "Looks ugly",
    "To make this work, we would need to adjust GeneralUtility",
    "Did you try to remove the contents of the typo3temp directory?",
    "You need to clear the reflection cache manually to solve this kind of problem",
    "Create a file typo3conf/ENABLE_INSTALL_TOOL",
    "Ensure that JavaScript and Cookies are enabled in your browser.",
    "The FLUIDTEMPLATE object was introduced in TYPO3 4.5.",
    "Finally TYPO3 has solid error handling since version 4.0.1.",
    "One way for extensions to take over control of certain parts of TYPO3's core is using hooks.",
    "Single quotes (') must be escaped with a single backslash, if surrounded by a higher level single quote of the outer ViewHelper",
    "After updating from TYPO3 < 4.0 to 4.0 or later versions, the plugin might stop working.",
    "Most advanced FTP programs have an 'edit' button. Please refer to your FTP program's documentation.",
    "$this->_dataStore = new tx_lib_spl_ArrayObject();",
    "You can tell me that TYPO3 4.4.9 and tt_news 2.5.0 is too old.",
    "“OOPS, AN ERROR OCCURRED!” IS NOT A VALID ERROR MESSAGE",
    "in the old times, you could XCLASS your way to world domination.",
    "Who the heck ist General Caches?",
    "Wow. Many caches. So general. Much flushes",
    "Can i haz t3lib_div?"
  ]
}
